trade/src/Catalogs/ВидыНалоговВзносов/ВидыНалоговВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалоговВзносов</name>
  <predefined>
    <items>
      <name>ЕдиныйНалоговыйПлатеж</name>
      <description>Единый налоговый платеж</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>ЕНВД</description>
    </items>
    <items>
      <name>ЕСХН</name>
      <description>ЕСХН</description>
    </items>
    <items>
      <name>ЗемельныйНалог</name>
      <description>Земельный налог</description>
    </items>
    <items>
      <name>НалогНаИмущество</name>
      <description>Налог на имущество организаций</description>
    </items>
    <items>
      <name>НалогНаПрибыль_РегиональныйБюджет</name>
      <description>Налог на прибыль, региональный бюджет</description>
    </items>
    <items>
      <name>НалогНаПрибыль_ФедеральныйБюджет</name>
      <description>Налог на прибыль, федеральный бюджет</description>
    </items>
    <items>
      <name>НДС</name>
      <description>НДС</description>
    </items>
    <items>
      <name>НДС_ВвозимыеТовары</name>
      <description>НДС при импорте товаров из ЕАЭС</description>
    </items>
    <items>
      <name>НДС_НалоговыйАгент</name>
      <description>НДС при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ</name>
      <description>НДФЛ при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>НДФЛ_ИП</name>
      <description>НДФЛ индивидуального предпринимателя </description>
    </items>
    <items>
      <name>ПрочиеНалогиИСборы</name>
      <description>Прочие налоги и сборы</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ТранспортныйНалог</name>
      <description>Транспортный налог организаций</description>
    </items>
    <items>
      <name>УСН_Доходы</name>
      <description>Налог при УСН (доходы)</description>
    </items>
    <items>
      <name>УСН_ДоходыМинусРасходы</name>
      <description>Налог при УСН (доходы минус расходы)</description>
    </items>
    <items>
      <name>УСН_МинимальныйНалог</name>
      <description>Минимальный налог УСН</description>
    </items>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>ПФР - по суммарному тарифу с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРСтраховаяЧасть</name>
      <description>Страховые взносы в ПФР</description>
    </items>
    <items>
      <name>ПФРНакопительнаяЧасть</name>
      <description>Страховые взносы в ПФР, накопительная часть (до 2014 г.)</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифЛЭ</name>
      <description>Взносы на выплату доплат к пенсии членам летных экипажей</description>
    </items>
    <items>
      <name>ПФРДополнительныйТарифШахтеры</name>
      <description>Взносы на выплату доплат к пенсии шахтерам</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с вредными условиями труда)</description>
    </items>
    <items>
      <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
      <description>Взносы в ПФР (дополнительный тариф за занятых на работах с тяжелыми условиями труда)</description>
    </items>
    <items>
      <name>ПФРСПревышения</name>
      <description>ПФР - с базы сверх предельной величины, с 1 января 2016 года</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>ТФОМС</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>ФССНС</name>
      <description>Страховые взносы от несчастных случаев</description>
    </items>
    <items>
      <name>НДФЛДоходыКонтрагентов</name>
      <description>НДФЛ с доходов контрагентов</description>
    </items>
    <items>
      <name>НДФЛДивиденды</name>
      <description>НДФЛ с дивидендов</description>
    </items>
    <items>
      <name>НДФЛДивидендыСотрудникам</name>
      <description>НДФЛ с дивидендов работникам</description>
    </items>
    <items>
      <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
      <description>НДФЛ, доначисленный по результатам проверки</description>
    </items>
    <items>
      <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
      <description>НДФЛ передача задолженности в налоговый орган</description>
    </items>
    <items>
      <name>НДФЛПрочиеРасчетыСПерсоналом</name>
      <description>НДФЛ с доходов по прочим операциям с персоналом</description>
    </items>
    <items>
      <name>НДФЛСПревышения</name>
      <description>НДФЛ с доходов свыше предельной величины, исчисленный налоговым агентом</description>
    </items>
    <items>
      <name>НДФЛДивидендыСПревышения</name>
      <description>НДФЛ с дивидендов свыше предельной величины</description>
    </items>
    <items>
      <name>ПФРДоПредельнойВеличины</name>
      <description>ПФР - с базы до предельной величины</description>
    </items>
    <items>
      <name>НДС_ОбратноеОбложение</name>
      <description>НДС налогового агента по отдельным видам товаров</description>
    </items>
    <items>
      <name>АУСН</name>
      <description>Налог при АУСН</description>
    </items>
    <items>
      <name>СтраховыеВзносыЕдиныйТариф</name>
      <description>Страховые взносы по единому тарифу</description>
    </items>
    <items>
      <name>ОПСИностранныхРаботников</name>
      <description>Взносы на пенсионное страхование иностранных работников</description>
    </items>
    <items>
      <name>ОМСИностранныхРаботников</name>
      <description>Взносы на медицинское страхование иностранных работников</description>
    </items>
    <items>
      <name>ОССИностранныхРаботников</name>
      <description>Взносы на социальное страхование иностранных работников</description>
    </items>
    <items>
      <name>НалогНаПрибыль_НалоговыйАгент</name>
      <description>Налог на прибыль при исполнении обязанностей налогового агента</description>
    </items>
  </predefined>
  <attributes>
    <name>ПлательщикСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/Enums/УдалитьТипыНалогов/УдалитьТипыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УдалитьТипыНалогов</name>
  <enumValues>
    <name>ЕдиныйНалоговыйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_РегиональныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_ФедеральныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДС_ВвозимыеТовары</name>
  </enumValues>
  <enumValues>
    <name>НДС_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>УСН_Доходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_ДоходыМинусРасходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_МинимальныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
  <enumValues>
    <name>ПФРСтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифЛЭ</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифШахтеры</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФССНС</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ПФРДоПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДС_ОбратноеОбложение</name>
  </enumValues>
  <enumValues>
    <name>АУСН</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ОПСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОМСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОССИностранныхРаботников</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/ВидыНалоговВзносов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов справочника.
//  ТабличныеЧасти - Структура - Ключ - Имя табличной части объекта.
//                               Значение - Выгрузка в таблицу значений пустой табличной части.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НДС";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'НДС'", КодыЯзыков);// @НСтр-2

	ВидыНалоговВзносовЛокализация.ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти);
	
КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.НаборыУпаковок - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Возврат;
КонецПроцедуры

// Получить ссылку предопределенного элемента.
// 
// Параметры:
//  ИмяПредопределенного - Строка - Имя предопределенного элемента
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыНалоговВзносов - Получить ссылку предопределенного элемента
Функция ПолучитьСсылкуПредопределенногоЭлемента(ИмяПредопределенного) Экспорт

	СправочникОбъект = Справочники.ВидыНалоговВзносов.СоздатьЭлемент();
	ИменаПредопределенных = СправочникОбъект.Метаданные().ПолучитьИменаПредопределенных();
	ЕстьПредопределенный = Ложь;
	Для Каждого Элемент Из ИменаПредопределенных Цикл
		Если НРег(Элемент) = НРег(ИмяПредопределенного) Тогда 
			ЕстьПредопределенный = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьПредопределенный Тогда
		Возврат Справочники.ВидыНалоговВзносов[ИмяПредопределенного];
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыНалоговВзносов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНалоговВзносов КАК ВидыНалоговВзносов
	|ГДЕ
	|	НРЕГ(ВидыНалоговВзносов.ИдентификаторЭлемента) = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", НРег(ИмяПредопределенного));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка;
	Иначе
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыНалоговВзносов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Наименование =  НаименованиеПредопределенногоЭлемента(ИмяПредопределенного); // Строка
			//@skip-check bsl-nstr-string-literal-format
			СправочникОбъект.Наименование = НСтр(Наименование, ОбщегоНазначения.КодОсновногоЯзыка());
			СправочникОбъект.ИдентификаторЭлемента = ИмяПредопределенного;
			СправочникОбъект.Записать();
			Ссылка = СправочникОбъект.Ссылка;
			ЗафиксироватьТранзакцию();
		Исключение

			ОтменитьТранзакцию();

			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось записать предопределенный элемент справочника ""Виды налогов и взносов"" %1:
					|%2';"),
				ИмяПредопределенного,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ВызватьИсключение ТекстИсключения;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Ссылка;
КонецФункции

// Наименование предопределенного элемента.
// 
// Параметры:
//  ИмяПредопределенного - Строка - Имя предопределенного элемента
// 
// Возвращаемое значение:
//  Строка - наименовование предопределенного элемента
Функция НаименованиеПредопределенногоЭлемента(ИмяПредопределенного) Экспорт
	Наименование = "";
	Если ИмяПредопределенного = "НДС_ВвозимыеТовары" Тогда
		Наименование = "ru = 'НДС при импорте товаров из ЕАЭС'"; // @НСтр-1
	ИначеЕсли ИмяПредопределенного = "НДС_НалоговыйАгент" Тогда
		Наименование = "ru = 'НДС при исполнении обязанностей налогового агента'"; // @НСтр-1
	КонецЕсли;
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = Перечисления.УдалитьТипыНалогов.НаименованиеПредопределенногоЭлемента(ИмяПредопределенного);
	КонецЕсли;
	Возврат Наименование;
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка, Метаданные.Справочники.ВидыНалоговВзносов);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
// 
// Возвращаемое значение:
// 	Массив - имена блокируемых реквизитов:
//		* БлокируемыйРеквизит - Строка - Имя блокируемого реквизита.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ПлательщикНалога");
	
	Возврат Результат;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

// Заполняет сведения об обработчиках обновления.
// 
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ВидыНалоговВзносов.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.20.33";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0b42d254-ccd3-453d-91c0-a524c04084ac");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.ВидыНалоговВзносов.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	
	МассивКомментариев = Новый Массив(); // Массив из Строка
	МассивКомментариев.Добавить(НСтр("ru = 'Очищает предопределенные элементы справочника ""Виды налогов и взносов для WE""'"));
	Обработчик.Комментарий = СтрСоединить(МассивКомментариев, " ");
	
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	
	Читаемые = Новый Массив; // Массив из Строка
	Читаемые.Добавить(Метаданные.Справочники.ВидыНалоговВзносов.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив; // Массив из Строка
	Изменяемые.Добавить(Метаданные.Справочники.ВидыНалоговВзносов.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив; // Массив из Строка
	Блокируемые.Добавить(Метаданные.Справочники.ВидыНалоговВзносов.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = СоздатьЭлемент().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Данные.Ссылка
	|ИЗ
	|	Справочник.ВидыНалоговВзносов КАК Данные
	|ГДЕ
	|	Данные.ИдентификаторЭлемента = """"";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
		Параметры,
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры обработчика:
//   * ВерсияПодсистемыНаНачалоОбновления - Строка - версия подсистемы.
//   * ИмяОбработчика - Строка - имя обработчика.
//   * ОбновляемыеДанные - Структура.
//   * ОбработкаЗавершена - Булево, Неопределено - признак завершения обработки.
//   * Очередь - Число - очередь.
//   * ПрогрессВыполнения - Структура:
//     ** ВсегоОбъектов - Число - всего обработано объектов.
//     ** ОбработаноОбъектов - Число - обработано объектов.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяОбъекта = ПустаяСсылка().Метаданные().ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	ОбъектовОбработано = 0;
	
	Для Каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
		
		ОписаниеИзменений = Новый Массив; // Массив из Строка
		ОписаниеИзменений.Добавить(НСтр("ru = 'При обновлении системы выполнены следующие операции:'"));
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			СправочникОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ВидыНалоговВзносов
			
			Если СправочникОбъект <> Неопределено Тогда
				СправочникОбъект.ИдентификаторЭлемента = СправочникОбъект.ИмяПредопределенныхДанных;
			КонецЕсли;
			ПредставлениеСсылки = Строка(СправочникОбъект);
			
			Если СправочникОбъект.Модифицированность() Тогда
				
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
				
			Иначе
				
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
				
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(
				ИнформацияОбОшибке(),
				СтрокаТаблицы.Ссылка,
				ПредставлениеСсылки);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
